#include <stdio.h>
int i=0,j=1,a=0,n=1,m=0;
int b[8]={0};

int main(){
	int c,d;
	int SP[8]={4,2,0,2,4,7,2,3};
	int S[8]={6,4,1,5,7,8,5,8};
	int One[8]={6,8,5,5,0,8,2,6};
	int ONe[8]={8,4,6,4,3,1,2,4};
	int ONE[8]={4,6,6,6,5,8,1,0};
	int six[8]={0,0,0,0,0,6,5,1};
	int SIX[8]={0,0,0,0,0,3,4,1};
	
	while(a>=0){
		printf("請輸入您的統一發票號碼：");
		scanf("%d",&c);
		d=c;
		/*此迴圈將輸入的整數轉成陣列*/
		for(i=7;i>=0;i--){
			b[i]=d%10;
			d=d/10;
		}
		/*將不同的獎項代入並判斷是否相同*/
		n=0;
		m=8;
		a=1000;
		other(SP);
		if(a==1000){		/*如果沒中再判斷特獎*/ 
			a=200;
			other(S);
		}
		if(a==200){			/*如果沒中再判斷頭獎*/ 
			a=20;
			other(One);
			other(ONe);
			other(ONE);
		}
		/*如果未中獎就判斷其他獎項*/
		if(a==20){
			for(n=1,m=7;n<7;n++,m--){		/*從二獎開始判斷，沒中就往下判斷*/ 
				other(One);
				other(ONe);
				other(ONE);
			}
		}
		/*如果還是未中獎就判斷增開六獎*/
		if(a==20){
			n=5;
			m=3;
			other(six);
			other(SIX);
		}
		/*如果中獎了就跳過,再執行下個大迴圈*/
		if(a==0){
			continue;
		}
		/*全部都沒中獎就88*/
		else{
			printf("抱歉！您沒有中獎\n\n");
		}
	}	
	return 0;
}

/*此副程式判斷輸入號碼跟中獎號碼的末位數相同幾個*/
int other(int s[8]){
	for(i=n,j=1;i<9&&j>=1;i++){				/*從陣列的第n個位數開始判斷且只要一個不同就停止*/
		if(b[i]==s[i]){						/*輸入數字是否跟中獎號碼相同*/ 
			if(j==m){                       /*j代表判斷成功的次數，m代表該獎項需相同的末幾位數，若兩者相同就執行中幾獎*/
				if(j==8&&a==1000){						/*如果在判斷特別獎或特獎或頭獎時號碼都相同就輸出並設a=0*/
					printf("恭喜您中特別獎 1000 萬元\n\n");
					a=0;
					}
				else if(j==8&&a==200){
					printf("恭喜您中特獎 200 萬元\n\n");
					a=0;
				}
				else if(j==8&&a==20){
					printf("恭喜您中頭獎 20 萬元\n\n");
					a=0;
				}
				if(m==7&&a==20){						/*用末幾位數判斷是中幾獎,且若a還是20代表未中獎,若中獎就輸出並設a=0*/
					printf("恭喜您中二獎 4 萬元\n\n");
					a=0;
				}
				else if(m==6&&a==20){
					printf("恭喜您中三獎 1 萬元\n\n");
					a=0;
				}
				else if(m==5&&a==20){
					printf("恭喜您中四獎 4000 元\n\n");
					a=0;
				}
				else if(m==4&&a==20){
					printf("恭喜您中五獎 1000 元\n\n");
					a=0;
				}
				else if(m==3&&a==20){
					printf("恭喜您中六獎 200 元\n\n");
					a=0;
					}
			}
			j++;										/*如果成功相同就加一*/
		}
		else{
			j=0;										/*只要有一個不同就設j=0*/
		}
	}
}
